In [6]:
import numpy as np
from IPython.display import display
import pandas as pd
import matplotlib.pyplot as plt

# Load the data from CSV files and display their information
# we handel the missing values and duplicates in the dataframes in each section
print('-' * 20, 'df_courses', '-' * 20)
df_courses = pd.read_csv("courses.csv")
display(df_courses.info())

print('-' * 20, 'df_students', '-' * 20)
df_students = pd.read_csv("students.csv")
display(df_students.info())

print('-' * 20, 'df_studnet_course', '-' * 20)
df_studnet_course = pd.read_csv("studnet_course.csv")
display(df_studnet_course.info())

print('-' * 20, 'df_teachers', '-' * 20)
df_teachers = pd.read_csv("teachers.csv")
display(df_teachers.info())

-------------------- df_courses --------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   course_id          50 non-null     int64
 1   course_name        50 non-null     object
 2   course_category    50 non-null     object
 3   teacher_id         45 non-null     float64
 4   course_start_date  50 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.1+ KB

None

-------------------- df_students --------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          500 non-null    int64
 1   first_name  500 non-null    object
 2   last_name   500 non-null    object
 3   gender      435 non-null    object
 4   age         471 non-null    float64
 5   city        500 non-null    object
 6   education   500 non-null    object
 7   email       500 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 31.4+ KB

None

-------------------- df_studnet_course --------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           1000 non-null   int64
 1   student_id   1000 non-null   int64
 2   course_id    1000 non-null   int64
 3   final_grade  938 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 31.4 KB

None

-------------------- df_teachers --------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   id                   35 non-null     int64
 1   first_name           35 non-null     object
 2   last_name            35 non-null     object
 3   gender               32 non-null     object
 4   years_of_experience  35 non-null     int64
 5   salary               32 non-null     float64
dtypes: float64(1), int64(2), object(3)
memory usage: 1.8+ KB

None

In [ ]:
# Level 1: Series of all rows with emails duplicate
df_dup = df_students[
    df_students.groupby('email')['id'].transform('count') > 1
].copy()

# Level 2: Adding column 'filled_count' to series which counts the number of non-null values in each row
df_dup['filled_count'] = df_dup.notnull().sum(axis=1)

# Level 3: Find the goodst rows for each email
idx_keep = df_dup.groupby('email')['filled_count'].idxmax()

# level 3.1 keep the id drop so we can search this id foe replacement in other tables the correct id 
idx_drop = df_dup.index.difference(idx_keep)
print('idx_drop')
display(idx_drop)

# Level 4: Choose the rows with most non-bull and delete the tempery column 'filled_count'
df_clean_dup = df_dup.loc[idx_keep].drop(columns='filled_count')

# Level 5: Choose the rows with no duplicates as unique
df_unique = df_students[
    df_students.groupby('email')['id'].transform('count') == 1
].copy()

# Level 6: merge the two dataframes
df_final = pd.concat([df_unique, df_clean_dup], ignore_index=True)
display(df_final)

idx_drop

Index([32, 65, 72, 90, 205], dtype='int64')

,id,first_name,last_name,gender,age,city,education,email
0,1,Birgit,Mackriell,Female,15.0,Haifa,No education,bmackriell0@china.com.cn
1,2,Cristionna,Ferrick,Female,32.0,Bnei Brak,High school,cferrick1@loc.gov
2,3,Colin,Tite,NaN,NaN,Petah Tikva,High school,ctite2@businessinsider.com
3,4,Jonis,Iston,Female,40.0,Jerusalem,High school,jiston3@edublogs.org
4,5,Dex,Goodson,Male,43.0,Haifa,Bachelor's degree,dgoodson4@e-recht24.de
...,...,...,...,...,...,...,...,...
490,500,Gillan,Terram,Female,34.0,Haifa,Bachelor's degree,gterramdv@friendfeed.com
491,27,Kaitlynn,Tansley,Female,39.0,Ashkelon,No education,ktansleyq@soup.io
492,39,Neil,Lipson,Male,27.0,Ashkelon,High school,nlipson12@foxnews.com
493,16,Sheffie,Fullom,Male,41.0,Haifa,Bachelor's degree,sfullomf@wp.com
494,89,Danny,Haythorne,Male,42.0,Tel Aviv,No education,wthirstw@youku.com